УправлениеПаркомАттракционов/src/Catalogs/Аттракционы/Аттракционы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Аттракционы</name>
  <attributes>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.АттракционыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоПеренесено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/Catalogs/Аттракционы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиФотоВПрисоедненныеФайлы(ПараметрыОбработки) Экспорт
	
	ПараметрыОбработки.ОбработкаЗавершена = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Аттракционы.Ссылка
		|ИЗ
		|	Справочник.Аттракционы КАК Аттракционы
		|ГДЕ
		|	НЕ Аттракционы.ФотоПеренесено";
		
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработки.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;		
	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
			
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДанныеФото = СпрОбъект.УдалитьФото.Получить();
			Если ДанныеФото <> Неопределено Тогда
				ПеренестиФотоВПрисоединенныйФайл(СпрОбъект, ДанныеФото);
			КонецЕсли;
			
			СпрОбъект.ФотоПеренесено = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

	КонецЦикла;
	
	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПеренестиФотоВПрисоединенныйФайл(СпрОбъект, ДанныеФото)
	
	АдресДанныхФайла = ПоместитьВоВременноеХранилище(ДанныеФото);
	
	ПараметрыДобавления = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыДобавления.ВладелецФайлов = СпрОбъект.Ссылка;
	ПараметрыДобавления.ИмяБезРасширения = "image";
	ПараметрыДобавления.РасширениеБезТочки = "png";
		
	ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыДобавления, АдресДанныхФайла);
	СпрОбъект.Фото = ПрисоединенныйФайл;	
	СпрОбъект.УдалитьФото = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
